

print('''
* ◄ ◊ ► ◄ ◊ ► ◄ ◊ ► ◄ ◊ ► ◄ ◊ ►*◄ ◊ ► ◄ ◊ ► ◄ ◊ ► ◄ ◊ ► ◄ ◊ ►*
* ◄ ◊ ► ◄ ◊ ► ◄ ◊ ►  MAGICA DE ADVINHAÇÃO   ◄ ◊ ► ◄ ◊ ► ◄ ◊ ►*
* ◄ ◊ ► ◄ ◊ ► ◄ ◊ ► ◄ ◊ ► ◄ ◊ ►*◄ ◊ ► ◄ ◊ ► ◄ ◊ ► ◄ ◊ ► ◄ ◊ ►*
''')
N=input('''
            [♥]]] [♦]]] [♣]]] [♠]]]
 NESTE PROGRAMA VOU ADVINHAR O NUMERO QUE ESTÁ PENSANDO
            DUVIDA? ENTÃO VAMOS LÁ...
            PENSE EM UM NUMERO INTEIRO DE : 
                    1 Á 31
                    PENSOU ?
AGORA DIGA SE SEU NUMERO APARECE NAS TEBELAS A SEGUIR...

—¤÷(`[¤* DIGITE "SIM" SE O NUMERO PENSADO ESTIVER NA TABELA. *¤]´)÷¤—
—¤÷(`[¤*  DIGITE "NÃO" CASO O NUMERO NÃO ESTEJA NA TABELA.   *¤]´)÷¤—

¸,ø¤º°`°º¤ø,¸¸,ø¤º° SEJA HONESTO NAS RESPOSTAS °º¤ø,¸¸,ø¤º°`°º¤ø,¸ 

      *¸ „„.•~¹°”ˆ˜¨ APERTE ENTER PARA COMEÇAR ¨˜ˆ”°¹~•.„¸*

''')

N1=input('''
                         SEU NUMERO A ESTA AQUI ?
꧁∙∙∙∙∙·▫▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫꧁    TABELA A    ꧂▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫▫·∙∙∙∙∙꧂


                            1	  3	  5	  7
                            9	  11	13	15
                            17	19	21	23
                            25	27	29	31
                

  ❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉

—¤÷(`[¤* DIGITE "SIM" SE O NUMERO PENSADO ESTIVER NA TABELA. *¤]´)÷¤—
—¤÷(`[¤*  DIGITE "NÃO" CASO O NUMERO NÃO ESTEJA NA TABELA.   *¤]´)÷¤—
:''').upper()

N2=input('''
                          SEU NUMERO A ESTA AQUI ?
꧁∙∙∙∙∙·▫▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫꧁    TABELA B    ꧂▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫▫·∙∙∙∙∙꧂


                            2 	3	  6	   7
                            10	11	14	15
                            18	19	22	23
                            26	27	30	31

                
  ❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉

—¤÷(`[¤* DIGITE "SIM" SE O NUMERO PENSADO ESTIVER NA TABELA. *¤]´)÷¤—
—¤÷(`[¤*  DIGITE "NÃO" CASO O NUMERO NÃO ESTEJA NA TABELA.   *¤]´)÷¤—
:''').upper()

N3=input('''
                          SEU NUMERO A ESTA AQUI ?
꧁∙∙∙∙∙·▫▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫꧁    TABELA C   ꧂▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫▫·∙∙∙∙∙꧂


                            4	  5	  6	  7
                            12	13	14	15
                            20	21	22	23
                            28	29	30	31
                

  ❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉

—¤÷(`[¤* DIGITE "SIM" SE O NUMERO PENSADO ESTIVER NA TABELA. *¤]´)÷¤—
—¤÷(`[¤*  DIGITE "NÃO" CASO O NUMERO NÃO ESTEJA NA TABELA.   *¤]´)÷¤—
:''').upper()

N4=input('''
                          SEU NUMERO A ESTA AQUI ?
꧁∙∙∙∙∙·▫▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫꧁    TABELA D    ꧂▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫▫·∙∙∙∙∙꧂


                            8	  9	  10	11
                            12	13	14	15
                            24	25	26	27
                            28	29	30	31

                
  ❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉

—¤÷(`[¤* DIGITE "SIM" SE O NUMERO PENSADO ESTIVER NA TABELA. *¤]´)÷¤—
—¤÷(`[¤*  DIGITE "NÃO" CASO O NUMERO NÃO ESTEJA NA TABELA.   *¤]´)÷¤—
:''').upper()

N5=input('''
                          SEU NUMERO A ESTA AQUI ?
꧁∙∙∙∙∙·▫▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫꧁    TABELA E    ꧂▫ₒₒ▫ᵒᴼᵒ▫ₒₒ▫ᵒᴼᵒ▫▫·∙∙∙∙∙꧂


                            16	17	18	19
                            20	21	22	23
                            24	25	26	27
                            28	29	30	31

                
  ❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉⊱•═•⊰❉

—¤÷(`[¤* DIGITE "SIM" SE O NUMERO PENSADO ESTIVER NA TABELA. *¤]´)÷¤—
—¤÷(`[¤*  DIGITE "NÃO" CASO O NUMERO NÃO ESTEJA NA TABELA.   *¤]´)÷¤—
:''').upper()
 
if N == '':
  pass

if N1 == 'SIM' :
  A=1
else:
  A=0

if N2 == 'SIM' :
  B = 2
else:
  B = 0

if N3 == 'SIM' :
  C = 4
else:
  C = 0

if N4 == 'SIM' :
  D = 8
else:
  D = 0

if N5 == 'SIM' :
  E = 16
else:
  E = 0

RES = A + B + C + D + E

print(f'''
███████▓█████▓▓╬╬╬╬╬╬╬╬▓███▓╬╬╬╬╬╬╬▓╬╬▓█ 
████▓▓▓▓╬╬▓█████╬╬╬╬╬╬███▓╬╬╬╬╬╬╬╬╬╬╬╬╬█ 
███▓▓▓▓╬╬╬╬╬╬▓██╬╬╬╬╬╬▓▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓█ 
████▓▓▓╬╬╬╬╬╬╬▓█▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓█ 
███▓█▓███████▓▓███▓╬╬╬╬╬╬▓███████▓╬╬╬╬▓█ 
████████████████▓█▓╬╬╬╬╬▓▓▓▓▓▓▓▓╬╬╬╬╬╬╬█ 
███▓▓▓▓▓▓▓╬╬▓▓▓▓▓█▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓█ 
████▓▓▓╬╬╬╬▓▓▓▓▓▓█▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓█ 
███▓█▓▓▓▓▓▓▓▓▓▓▓▓▓▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓█ 
█████▓▓▓▓▓▓▓▓█▓▓▓█▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓█ 
█████▓▓▓▓▓▓▓██▓▓▓█▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬██ 
█████▓▓▓▓▓████▓▓▓█▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬██ 
████▓█▓▓▓▓██▓▓▓▓██╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬██ 
████▓▓███▓▓▓▓▓▓▓██▓╬╬╬╬╬╬╬╬╬╬╬╬█▓╬▓╬╬▓██ 
█████▓███▓▓▓▓▓▓▓▓████▓▓╬╬╬╬╬╬╬█▓╬╬╬╬╬▓██ 
█████▓▓█▓███▓▓▓████╬▓█▓▓╬╬╬▓▓█▓╬╬╬╬╬╬███ 
██████▓██▓███████▓╬╬╬▓▓╬▓▓██▓╬╬╬╬╬╬╬▓███ 
███████▓██▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓╬╬╬╬╬╬╬╬╬╬╬████ 
███████▓▓██▓▓▓▓▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓████ 
████████▓▓▓█████▓▓╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬╬▓█████ 
█████████▓▓▓█▓▓▓▓▓███▓╬╬╬╬╬╬╬╬╬╬╬▓██████ 
██████████▓▓▓█▓▓▓╬▓██╬╬╬╬╬╬╬╬╬╬╬▓███████ 
███████████▓▓█▓▓▓▓███▓╬╬╬╬╬╬╬╬╬▓████████ 
██████████████▓▓▓███▓▓╬╬╬╬╬╬╬╬██████████ 
███████████████▓▓▓██▓▓╬╬╬╬╬╬▓███████████
* • • ◕◕════ ♣ O NÚMERO QUE VOCÊ PENSOU É : ♣ ════◕◕ • •*

                         {RES}


                ─────█─▄▀█──█▀▄─█─────
                ────▐▌──────────▐▌────
                ────█▌▀▄──▄▄──▄▀▐█────
                ───▐██──▀▀──▀▀──██▌───
                ──▄████▄──▐▌──▄████▄──
''')